zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE31B/drivers/fsl_clock.h
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef FSL_CLOCK_H_
#define FSL_CLOCK_H_

#include "fsl_common.h"

/*! @addtogroup clock */
/*! @{ */

/*! @file */

/*******************************************************************************
 * Definitions
 *****************************************************************************/
/*! @name Driver version */
/*@{*/
/*! @brief CLOCK driver version 2.2.1 */
#define FSL_CLOCK_DRIVER_VERSION (MAKE_VERSION(2, 2, 1))
/*@}*/

/*! @brief Retry times for waiting flag. */
#ifndef CLOCK_RETRY_TIMES
#ifdef CONFIG_CLOCK_RETRY_TIMES
#define CLOCK_RETRY_TIMES CONFIG_CLOCK_RETRY_TIMES
#else
#define CLOCK_RETRY_TIMES 0U /* Defining to zero means to keep waiting for the flag until it is assert/deassert. */
#endif
#endif

/* Definition for delay API in clock driver, users can redefine it to the real
 * application. */
#ifndef SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY
#define SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY (160000000UL)
#endif /* SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY */

#ifndef CLOCK_FIRC_CLK_FREQ
#define CLOCK_FIRC_CLK_FREQ (48000000U)
#endif

#ifndef CLOCK_SIRC_CLK_FREQ
#define CLOCK_SIRC_CLK_FREQ (32000U)
#endif
#if defined(FSL_FEATURE_MC_CGM_HAS_SXOSC) && (FSL_FEATURE_MC_CGM_HAS_SXOSC != 0U)
#ifndef CLOCK_SXOSC_CLK_FREQ
#define CLOCK_SXOSC_CLK_FREQ (32768U)
#endif /* CLOCK_SXOSC_CLK_FREQ */
#endif /* FSL_FEATURE_MC_CGM_HAS_SXOSC */

/*! @brief driver feature definition */
#if defined(QUADSPI)
#define FSL_FEATURE_CLOCK_HAS_QSPI (1U)
#endif
#if defined(EMAC)
#define FSL_FEATURE_CLOCK_HAS_EMAC (1U)
#endif

/*! @brief External XTAL0 (FXOSC) clock frequency.
 *
 * The XTAL0/EXTAL0 (FXOSC) clock frequency in Hz. When the clock is set up, use the
 * function CLOCK_InitFxosc to set the value in the clock driver. For example,
 * if XTAL0 is 8 MHz:
 * @code
 * Set up the FXOSC
 * CLOCK_InitFxosc(...);
 * @endcode
 *
 */
extern volatile uint32_t g_xtal0Freq;

/******************************************************************************
 * MC_MCG clock sources mapping
 *******************************************************************************/
#define CLOCK_FIRC_CLK  0U         /*!< FIRC clock*/
#define CLOCK_SIRC_CLK  1U         /*!< SIRC clock*/
#define CLOCK_FXOSC_CLK 2U         /*!< FXOSC clock*/
#if defined(FSL_FEATURE_MC_CGM_HAS_SXOSC) && (FSL_FEATURE_MC_CGM_HAS_SXOSC != 0U)
#define CLOCK_SXOSC_CLK 4U         /*!< SXOSC clock*/
#endif
#define CLOCK_PLL_PHI0_CLK  8U     /*!< PLL PHI0 clock*/
#define CLOCK_PLL_PHI1_CLK  9U     /*!< PLL PHI1 clock*/
#define CLOCK_CORE_CLK      16U    /*!< M7 core clock*/
#define CLOCK_HSE_CLK       19U    /*!< HSE clock*/
#define CLOCK_AIPS_PLAT_CLK 22U    /*!< SRAM/AXBS clock*/
#define CLOCK_AIPS_SLOW_CLK 23U    /*!< peripheral clock*/
#if defined(FSL_FEATURE_CLOCK_HAS_EMAC) && (FSL_FEATURE_CLOCK_HAS_EMAC != 0U)
#define CLOCK_EMAC_RMII_TX_CLK 24U /*!< Ethernet MAC RMII transmit clock*/
#define CLOCK_EMAC_RX_CLK      25U /*!< Ethernet MAC Receive clock*/
#endif                             /* FSL_FEATURE_CLOCK_HAS_EMAC */
#define CLOCK_CLKOUT_RUN_CLK 50U   /*!< Clock output in RUN mode*/

/*! @brief Clock ip name array for CRC. */
#define CRC_CLOCKS  \
    {               \
        kCLOCK_Crc0 \
    }

/*! @brief Clock ip name array for TEMPSENSE. */
#define TEMPSENSOR_CLOCKS \
    {                     \
        kCLOCK_TempSensor \
    }

/*! @brief Clock ip name array for BCTU. */
#define BCTU_CLOCKS \
    {               \
        kCLOCK_Bctu \
    }

/*! @brief Clock ip name array for ADC. */
#if defined(FSL_FEATURE_SOC_ADC_COUNT) && (FSL_FEATURE_SOC_ADC_COUNT > 2U)
#define ADC_CLOCKS                            \
    {                                         \
        kCLOCK_Adc0, kCLOCK_Adc1, kCLOCK_Adc2 \
    }
#else
#define ADC_CLOCKS               \
    {                            \
        kCLOCK_Adc0, kCLOCK_Adc1 \
    }
#endif /* FSL_FEATURE_SOC_ADC_COUNT */

/*! @brief Clock ip name array for DMAMUX. */
#define DMAMUX_CLOCKS                  \
    {                                  \
        kCLOCK_Dmamux0, kCLOCK_Dmamux1 \
    }

/*! @brief Clock ip name array for EDMA. */
#define EDMA_CLOCKS \
    {               \
        kCLOCK_Edma \
    }

/*! @brief Clock ip name array for EMAC. */
#define EMAC_CLOCKS \
    {               \
        kCLOCK_Emac \
    }

/*! @brief Clock ip name array for EDMA TCD. */
#if defined(FSL_FEATURE_MC_ME_HAS_PRTN2) && (FSL_FEATURE_MC_ME_HAS_PRTN2 != 0U)
#define EDMA_TCD_CLOCKS                                                                                         \
    {                                                                                                           \
        kCLOCK_Tcd0, kCLOCK_Tcd1, kCLOCK_Tcd2, kCLOCK_Tcd3, kCLOCK_Tcd4, kCLOCK_Tcd5, kCLOCK_Tcd6, kCLOCK_Tcd7, \
            kCLOCK_Tcd8, kCLOCK_Tcd9, kCLOCK_Tcd10, kCLOCK_Tcd11, kCLOCK_Tcd12, kCLOCK_Tcd13, kCLOCK_Tcd14,     \
            kCLOCK_Tcd15, kCLOCK_Tcd16, kCLOCK_Tcd17, kCLOCK_Tcd18, kCLOCK_Tcd19, kCLOCK_Tcd20, kCLOCK_Tcd21,   \
            kCLOCK_Tcd22, kCLOCK_Tcd23, kCLOCK_Tcd24, kCLOCK_Tcd25, kCLOCK_Tcd26, kCLOCK_Tcd27, kCLOCK_Tcd28,   \
            kCLOCK_Tcd29, kCLOCK_Tcd30, kCLOCK_Tcd31                                                            \
    }
#else
#define EDMA_TCD_CLOCKS                                                                                         \
    {                                                                                                           \
        kCLOCK_Tcd0, kCLOCK_Tcd1, kCLOCK_Tcd2, kCLOCK_Tcd3, kCLOCK_Tcd4, kCLOCK_Tcd5, kCLOCK_Tcd6, kCLOCK_Tcd7, \
            kCLOCK_Tcd8, kCLOCK_Tcd9, kCLOCK_Tcd10, kCLOCK_Tcd11,                                               \
    }
#endif /* FSL_FEATURE_MC_ME_HAS_PRTN2 */

/*! @brief Clock ip name array for EIM. */
#define EIM_CLOCKS \
    {              \
        kCLOCK_Eim \
    }

/*! @brief Clock ip name array for EMIOS. */
#if defined(FSL_FEATURE_SOC_EMIOS_COUNT) && (FSL_FEATURE_SOC_EMIOS_COUNT > 2U)
#define EMIOS_CLOCKS                                \
    {                                               \
        kCLOCK_Emios0, kCLOCK_Emios1, kCLOCK_Emios2 \
    }
#else
#define EMIOS_CLOCKS                 \
    {                                \
        kCLOCK_Emios0, kCLOCK_Emios1 \
    }
#endif

/*! @brief Clock ip name array for ERM. */
#define ERM_CLOCKS \
    {              \
        kCLOCK_Erm \
    }

#if defined(FSL_FEATURE_SOC_FLEXCAN_COUNT) && (FSL_FEATURE_SOC_FLEXCAN_COUNT == 6U)
/*! @brief Clock ip name array for FLEXCAN. */
#define FLEXCAN_CLOCKS                                                                                        \
    {                                                                                                         \
        kCLOCK_Flexcan0, kCLOCK_Flexcan1, kCLOCK_Flexcan2, kCLOCK_Flexcan3, kCLOCK_Flexcan4, kCLOCK_Flexcan5, \
    }
#else
/*! @brief Clock ip name array for FLEXCAN. */
#define FLEXCAN_CLOCKS                                    \
    {                                                     \
        kCLOCK_Flexcan0, kCLOCK_Flexcan1, kCLOCK_Flexcan2 \
    }
#endif /* FSL_FEATURE_SOC_FLEXCAN_COUNT */

/*! @brief Clock ip name array for FLEXIO. */
#define FLEXIO_CLOCKS \
    {                 \
        kCLOCK_Flexio \
    }

#if defined(FSL_FEATURE_SOC_QuadSPI_COUNT) && (FSL_FEATURE_SOC_QuadSPI_COUNT != 0U)
/*! @brief Clock ip name array for QSPI. */
#define QSPI_CLOCKS \
    {               \
        kCLOCK_Qspi \
    }
#endif /* FSL_FEATURE_SOC_QuadSPI_COUNT */

