zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE31B/drivers/fsl_clock.h
/*! @brief Clock ip name array for LCU. */
#define LCU_CLOCKS               \
    {                            \
        kCLOCK_Lcu0, kCLOCK_Lcu1 \
    }

/*! @brief Clock ip name array for LPCMP. */
#if defined(FSL_FEATURE_SOC_LPCMP_COUNT) && (FSL_FEATURE_SOC_LPCMP_COUNT == 3U)
#define LPCMP_CLOCKS                                 \
    {                                                \
        kCLOCK_Lpcmp0, kCLOCK_Lpcmp1, kCLOCK_Lpcmp2, \
    }
#elif defined(FSL_FEATURE_SOC_LPCMP_COUNT) && (FSL_FEATURE_SOC_LPCMP_COUNT == 2U)
#define LPCMP_CLOCKS                 \
    {                                \
        kCLOCK_Lpcmp0, kCLOCK_Lpcmp1 \
    }
#else
#define LPCMP_CLOCKS  \
    {                 \
        kCLOCK_Lpcmp0 \
    }
#endif /* FSL_FEATURE_SOC_LPCMP_COUNT */

/*! @brief Clock ip name array for LPI2C. */
#define LPI2C_CLOCKS                 \
    {                                \
        kCLOCK_Lpi2c0, kCLOCK_Lpi2c1 \
    }

#if defined(FSL_FEATURE_SOC_LPUART_COUNT) && (FSL_FEATURE_SOC_LPUART_COUNT == 16U)
/*! @brief Clock ip name array for LPUART. */
#define LPUART_CLOCKS                                                                                         \
    {                                                                                                         \
        kCLOCK_Lpuart0, kCLOCK_Lpuart1, kCLOCK_Lpuart2, kCLOCK_Lpuart3, kCLOCK_Lpuart4, kCLOCK_Lpuart5,       \
            kCLOCK_Lpuart6, kCLOCK_Lpuart7, kCLOCK_Lpuart8, kCLOCK_Lpuart9, kCLOCK_Lpuart10, kCLOCK_Lpuart11, \
            kCLOCK_Lpuart12, kCLOCK_Lpuart13, kCLOCK_Lpuart14, kCLOCK_Lpuart15                                \
    }
#elif (FSL_FEATURE_SOC_LPUART_COUNT == 8U)
/*! @brief Clock ip name array for LPUART. */
#define LPUART_CLOCKS                                                                                   \
    {                                                                                                   \
        kCLOCK_Lpuart0, kCLOCK_Lpuart1, kCLOCK_Lpuart2, kCLOCK_Lpuart3, kCLOCK_Lpuart4, kCLOCK_Lpuart5, \
            kCLOCK_Lpuart6, kCLOCK_Lpuart7                                                              \
    }
#else
/*! @brief Clock ip name array for LPUART. */
#define LPUART_CLOCKS                                                  \
    {                                                                  \
        kCLOCK_Lpuart0, kCLOCK_Lpuart1, kCLOCK_Lpuart2, kCLOCK_Lpuart3 \
    }
#endif
#if defined(FSL_FEATURE_SOC_LPSPI_COUNT) && (FSL_FEATURE_SOC_LPUART_COUNT == 6U)
/*! @brief Clock ip name array for LPSPI. */
#define LPSPI_CLOCKS                                                                             \
    {                                                                                            \
        kCLOCK_Lpspi0, kCLOCK_Lpspi1, kCLOCK_Lpspi2, kCLOCK_Lpspi3, kCLOCK_Lpspi4, kCLOCK_Lpspi5 \
    }
#else
/*! @brief Clock ip name array for LPSPI. */
#define LPSPI_CLOCKS                                               \
    {                                                              \
        kCLOCK_Lpspi0, kCLOCK_Lpspi1, kCLOCK_Lpspi2, kCLOCK_Lpspi3 \
    }
#endif

#if defined(FSL_FEATURE_SOC_PIT_COUNT) && (FSL_FEATURE_SOC_PIT_COUNT == 3U)
/*! @brief Clock ip name array for PIT. */
#define PIT_CLOCKS                            \
    {                                         \
        kCLOCK_Pit0, kCLOCK_Pit1, kCLOCK_Pit2 \
    }
#else
/*! @brief Clock ip name array for PIT. */
#define PIT_CLOCKS               \
    {                            \
        kCLOCK_Pit0, kCLOCK_Pit1 \
    }
#endif

#if defined(FSL_FEATURE_SOC_I2S_COUNT) && (FSL_FEATURE_SOC_I2S_COUNT == 2U)
/*! @brief Clock ip name array for SAI. */
#define SAI_CLOCKS               \
    {                            \
        kCLOCK_Sai0, kCLOCK_Sai1 \
    }
#endif /* FSL_FEATURE_SOC_I2S_COUNT */

#if defined(FSL_FEATURE_SOC_SEMA42_COUNT) && (FSL_FEATURE_SOC_SEMA42_COUNT != 0U)
/*! @brief Clock ip name array for SEMA42. */
#define SEMA42_CLOCKS \
    {                 \
        kCLOCK_Sema42 \
    }
#endif /* FSL_FEATURE_SOC_SEMA42_COUNT */

/*! @brief Clock ip name array for STM. */
#if defined(FSL_FEATURE_SOC_STM_COUNT) && (FSL_FEATURE_SOC_STM_COUNT == 2U)
#define STM_CLOCKS               \
    {                            \
        kCLOCK_Stm0, kCLOCK_Stm1 \
    }
#else
#define STM_CLOCKS  \
    {               \
        kCLOCK_Stm0 \
    }
#endif /* FSL_FEATURE_SOC_STM_COUNT */

/*! @brief Clock ip name array for SWT. */
#define SWT_CLOCKS   \
    {                \
        kCLOCK_Swt0, \
    }

/*! @brief Clock ip name array for TSPC. */
#define TSPC_CLOCKS  \
    {                \
        kCLOCK_Tspc, \
    }

#define MC_ME_TUPLE_PRTN_MASK  (0x0FFF0000U)
#define MC_ME_TUPLE_PRTN_SHIFT (16U)
#define MC_ME_TUPLE_BIT_MASK   (0x1FU)
/*! Help macro, bit16 to bit 28 is COFB register offset, bit0 to bit4 is bitfield. */
#define MC_ME_COFB_TUPLE(reg, bit)   (((reg) << MC_ME_TUPLE_PRTN_SHIFT) | (bit))
#define MC_ME_COFB_STAT_CLKEN_OFFSET (0x20U)
#define MC_ME_COFB_OFFSET(tuple)     (((tuple)&MC_ME_TUPLE_PRTN_MASK) >> MC_ME_TUPLE_PRTN_SHIFT)
#define MC_ME_PRTN_PCONF_REG(tuple) \
    (*((volatile uint32_t *)(((uint32_t)MC_ME + MC_ME_COFB_OFFSET(tuple)) & 0xFFFFFF00U)))
#define MC_ME_PRTN_PUPD_REG(tuple) \
    (*((volatile uint32_t *)((((uint32_t)MC_ME + MC_ME_COFB_OFFSET(tuple)) & 0xFFFFFF00U) + 4U)))
#define MC_ME_COFB_CLKEN_REG(tuple) (*((volatile uint32_t *)((uint32_t)MC_ME + MC_ME_COFB_OFFSET(tuple))))
#define MC_ME_COFB_STAT_REG(tuple) \
    (*((volatile uint32_t *)((uint32_t)MC_ME + MC_ME_COFB_OFFSET(tuple) - MC_ME_COFB_STAT_CLKEN_OFFSET)))
#define MC_ME_COFB_CLKEN_BIT(tuple) ((tuple)&MC_ME_TUPLE_BIT_MASK)

/*! @brief Clock gate name used for CLOCK_EnableClock/CLOCK_DisableClock. */
typedef enum _clock_ip_name
{
    kCLOCK_IpInvalid = 0U, /*!< Invalid Ip Name. */

    /* PRTN0_COFB1_CLKEN Bit Fields */
    kCLOCK_Trgmux = MC_ME_COFB_TUPLE(0x134U, 0), /*!< Trigger Multiplexing Control (PRTN0_COFB1) */
    kCLOCK_Bctu   = MC_ME_COFB_TUPLE(0x134U, 1), /*!< Body Cross Triggering Unit (PRTN0_COFB1) */
    kCLOCK_Emios0 = MC_ME_COFB_TUPLE(0x134U, 2), /*!< EMIOS 0 (PRTN0_COFB1) */
    kCLOCK_Emios1 = MC_ME_COFB_TUPLE(0x134U, 3), /*!< EMIOS 1 (PRTN0_COFB1) */
#if defined(FSL_FEATURE_SOC_EMIOS_COUNT) && (FSL_FEATURE_SOC_EMIOS_COUNT > 2U)
    kCLOCK_Emios2 = MC_ME_COFB_TUPLE(0x134U, 4), /*!< EMIOS 2 (PRTN0_COFB1) */
#endif                                           /* FSL_FEATURE_SOC_EMIOS_COUNT */
    kCLOCK_Lcu0 = MC_ME_COFB_TUPLE(0x134U, 6),   /*!< Logic Control Unit 0 (PRTN0_COFB1) */
    kCLOCK_Lcu1 = MC_ME_COFB_TUPLE(0x134U, 7),   /*!< Logic Control Unit 1 (PRTN0_COFB1) */
    kCLOCK_Adc0 = MC_ME_COFB_TUPLE(0x134U, 8),   /*!< Analog-to-digital converter 0 (PRTN0_COFB1) */
    kCLOCK_Adc1 = MC_ME_COFB_TUPLE(0x134U, 9),   /*!< Analog-to-digital converter 1 (PRTN0_COFB1) */
#if defined(FSL_FEATURE_SOC_ADC_COUNT) && (FSL_FEATURE_SOC_ADC_COUNT > 2U)
    kCLOCK_Adc2 = MC_ME_COFB_TUPLE(0x134U, 10),  /*!< Analog-to-digital converter 2 (PRTN0_COFB1) */
#endif                                           /* FSL_FEATURE_SOC_ADC_COUNT */
    kCLOCK_Pit0 = MC_ME_COFB_TUPLE(0x134U, 12),  /*!< Programmable Interrupt Timer 0 (PRTN0_COFB1) */
    kCLOCK_Pit1 = MC_ME_COFB_TUPLE(0x134U, 13),  /*!< Programmable Interrupt Timer 1 (PRTN0_COFB1) */
    /* PRTN1_COFB0_CLKEN Bit Fields */
    kCLOCK_Edma  = MC_ME_COFB_TUPLE(0x330U, 3),  /*!< EDMA control & status (MP_CSR; MP_ES; MP_HRS) (PRTN1_COFB0) */
    kCLOCK_Tcd0  = MC_ME_COFB_TUPLE(0x330U, 4),  /*!< EDMA transfer control descriptor 0 (PRTN1_COFB0) */
    kCLOCK_Tcd1  = MC_ME_COFB_TUPLE(0x330U, 5),  /*!< EDMA transfer control descriptor 1 (PRTN1_COFB0) */
    kCLOCK_Tcd2  = MC_ME_COFB_TUPLE(0x330U, 6),  /*!< EDMA transfer control descriptor 2 (PRTN1_COFB0) */
    kCLOCK_Tcd3  = MC_ME_COFB_TUPLE(0x330U, 7),  /*!< EDMA transfer control descriptor 3 (PRTN1_COFB0) */
    kCLOCK_Tcd4  = MC_ME_COFB_TUPLE(0x330U, 8),  /*!< EDMA transfer control descriptor 4 (PRTN1_COFB0) */
    kCLOCK_Tcd5  = MC_ME_COFB_TUPLE(0x330U, 9),  /*!< EDMA transfer control descriptor 5 (PRTN1_COFB0) */
    kCLOCK_Tcd6  = MC_ME_COFB_TUPLE(0x330U, 10), /*!< EDMA transfer control descriptor 6 (PRTN1_COFB0) */
    kCLOCK_Tcd7  = MC_ME_COFB_TUPLE(0x330U, 11), /*!< EDMA transfer control descriptor 7 (PRTN1_COFB0) */
    kCLOCK_Tcd8  = MC_ME_COFB_TUPLE(0x330U, 12), /*!< EDMA transfer control descriptor 8 (PRTN1_COFB0) */
    kCLOCK_Tcd9  = MC_ME_COFB_TUPLE(0x330U, 13), /*!< EDMA transfer control descriptor 9 (PRTN1_COFB0) */
    kCLOCK_Tcd10 = MC_ME_COFB_TUPLE(0x330U, 14), /*!< EDMA transfer control descriptor 10 (PRTN1_COFB0) */
    kCLOCK_Tcd11 = MC_ME_COFB_TUPLE(0x330U, 15), /*!< EDMA transfer control descriptor 11 (PRTN1_COFB0) */
    kCLOCK_Sda   = MC_ME_COFB_TUPLE(0x330U, 21), /*!< SDA-AP (PRTN1_COFB0) */
    kCLOCK_Eim   = MC_ME_COFB_TUPLE(0x330U, 22), /*!< EIM (PRTN1_COFB0) */
    kCLOCK_Erm   = MC_ME_COFB_TUPLE(0x330U, 23), /*!< ERM (PRTN1_COFB0) */
    kCLOCK_Mscm  = MC_ME_COFB_TUPLE(0x330U, 24), /*!< MSCM (PRTN1_COFB0) */
    kCLOCK_Swt0  = MC_ME_COFB_TUPLE(0x330U, 28), /*!< Software Watchdog 0 (PRTN1_COFB0) */
    kCLOCK_Stm0  = MC_ME_COFB_TUPLE(0x330U, 29), /*!< System Timer Module 0 (PRTN1_COFB0) */
    kCLOCK_Intm  = MC_ME_COFB_TUPLE(0x330U, 31), /*!< Interrupt Monitor (PRTN1_COFB0) */
    /* PRTN1_COFB1_CLKEN Bit Fields */
    kCLOCK_Dmamux0 = MC_ME_COFB_TUPLE(0x334U, 0),  /*!< DMA Channel Multiplexer 0 (PRTN1_COFB1) */
    kCLOCK_Dmamux1 = MC_ME_COFB_TUPLE(0x334U, 1),  /*!< DMA Channel Multiplexer 1 (PRTN1_COFB1) */
    kCLOCK_Rtc     = MC_ME_COFB_TUPLE(0x334U, 2),  /*!< Real-time clock (PRTN1_COFB1) */
    kCLOCK_Vwrap   = MC_ME_COFB_TUPLE(0x334U, 10), /*!< SIUL2_VIRTWRAPPER (PRTN1_COFB1) */
    kCLOCK_Wkup    = MC_ME_COFB_TUPLE(0x334U, 13), /*!< Wakeup Unit (PRTN1_COFB1) */
    kCLOCK_Cmu05   = MC_ME_COFB_TUPLE(0x334U, 15), /*!< CMU 0-5 (PRTN1_COFB1) */
    kCLOCK_Tspc    = MC_ME_COFB_TUPLE(0x334U, 17), /*!< Touch Sensing Coupling Controller (PRTN1_COFB1) */
#if defined(FSL_FEATURE_MC_CGM_HAS_SXOSC) && (FSL_FEATURE_MC_CGM_HAS_SXOSC != 0U)
    kCLOCK_Sxosc = MC_ME_COFB_TUPLE(0x334U, 19U),  /*!< 32 kHz Slow External Crystal Oscillator (PRTN1_COFB1) */
#endif                                             /* FSL_FEATURE_MC_CGM_HAS_SXOSC */
    kCLOCK_Fxosc = MC_ME_COFB_TUPLE(0x334U, 21U),  /*!< 8-40 MHz Fast External Crystal Oscillator (PRTN1_COFB1) */
    kCLOCK_Pll   = MC_ME_COFB_TUPLE(0x334U, 24U),  /*!< Frequency Modulated Phase-Locked Loop (PRTN1_COFB1) */
#if defined(FSL_FEATURE_SOC_PIT_COUNT) && (FSL_FEATURE_SOC_PIT_COUNT > 2U)
    kCLOCK_Pit2 = MC_ME_COFB_TUPLE(0x334U, 31U),   /*!< Programmable Interrupt Timer 2 (PRTN1_COFB1) */
#endif                                             /* FSL_FEATURE_SOC_PIT_COUNT */
    /* PRTN1_COFB2_CLKEN Bit Fields */
    kCLOCK_Flexcan0 = MC_ME_COFB_TUPLE(0x338U, 1),    /*!< FlexCAN 0 (PRTN1_COFB2) */
    kCLOCK_Flexcan1 = MC_ME_COFB_TUPLE(0x338U, 2),    /*!< FlexCAN 1 (PRTN1_COFB2) */
    kCLOCK_Flexcan2 = MC_ME_COFB_TUPLE(0x338U, 3),    /*!< FlexCAN 2 (PRTN1_COFB2) */
#if defined(FSL_FEATURE_MC_CGM_HAS_MUX_4) && (FSL_FEATURE_MC_CGM_HAS_MUX_4 != 0U)
    kCLOCK_Flexcan3 = MC_ME_COFB_TUPLE(0x338U, 4),    /*!< FlexCAN 3 (PRTN1_COFB2) */
    kCLOCK_Flexcan4 = MC_ME_COFB_TUPLE(0x338U, 5),    /*!< FlexCAN 4 (PRTN1_COFB2) */
    kCLOCK_Flexcan5 = MC_ME_COFB_TUPLE(0x338U, 6),    /*!< FlexCAN 5 (PRTN1_COFB2) */
#endif                                                /* FSL_FEATURE_MC_CGM_HAS_MUX_4 */
    kCLOCK_Flexio  = MC_ME_COFB_TUPLE(0x338U, 9),     /*!< Flexible IO (PRTN1_COFB2) */
    kCLOCK_Lpuart0 = MC_ME_COFB_TUPLE(0x338U, 10U),   /*!< Low Power UART 0 (PRTN1_COFB2) */
    kCLOCK_Lpuart1 = MC_ME_COFB_TUPLE(0x338U, 11U),   /*!< Low Power UART 1 (PRTN1_COFB2) */
    kCLOCK_Lpuart2 = MC_ME_COFB_TUPLE(0x338U, 12U),   /*!< Low Power UART 2 (PRTN1_COFB2) */
    kCLOCK_Lpuart3 = MC_ME_COFB_TUPLE(0x338U, 13U),   /*!< Low Power UART 3 (PRTN1_COFB2) */
#if defined(FSL_FEATURE_SOC_LPUART_COUNT) && (FSL_FEATURE_SOC_LPUART_COUNT > 4U)
    kCLOCK_Lpuart4 = MC_ME_COFB_TUPLE(0x338U, 14U),   /*!< Low Power UART 4 (PRTN1_COFB2) */
    kCLOCK_Lpuart5 = MC_ME_COFB_TUPLE(0x338U, 15U),   /*!< Low Power UART 5 (PRTN1_COFB2) */
    kCLOCK_Lpuart6 = MC_ME_COFB_TUPLE(0x338U, 16U),   /*!< Low Power UART 6 (PRTN1_COFB2) */
    kCLOCK_Lpuart7 = MC_ME_COFB_TUPLE(0x338U, 17U),   /*!< Low Power UART 7 (PRTN1_COFB2) */
#endif
    kCLOCK_Lpi2c0 = MC_ME_COFB_TUPLE(0x338U, 20U),    /*!< Low Power I2C 0 (PRTN1_COFB2) */
    kCLOCK_Lpi2c1 = MC_ME_COFB_TUPLE(0x338U, 21U),    /*!< Low Power I2C 1 (PRTN1_COFB2) */
    kCLOCK_Lpspi0 = MC_ME_COFB_TUPLE(0x338U, 22U),    /*!< Low Power SPI 0 (PRTN1_COFB2) */
    kCLOCK_Lpspi1 = MC_ME_COFB_TUPLE(0x338U, 23U),    /*!< Low Power SPI 1 (PRTN1_COFB2) */
    kCLOCK_Lpspi2 = MC_ME_COFB_TUPLE(0x338U, 24U),    /*!< Low Power SPI 2 (PRTN1_COFB2) */
    kCLOCK_Lpspi3 = MC_ME_COFB_TUPLE(0x338U, 25U),    /*!< Low Power SPI 3 (PRTN1_COFB2) */
#if defined(FSL_FEATURE_SOC_I2S_COUNT)
    kCLOCK_Sai0 = MC_ME_COFB_TUPLE(0x338U, 27),       /*!< Synchronous Audio Interface 0 (PRTN1_COFB2) */
#endif
    kCLOCK_Lpcmp0 = MC_ME_COFB_TUPLE(0x338U, 28),     /*!< Low Power CMP 0 (PRTN1_COFB2) */
#if defined(FSL_FEATURE_SOC_LPCMP_COUNT) && (FSL_FEATURE_SOC_LPCMP_COUNT > 1U)
    kCLOCK_Lpcmp1 = MC_ME_COFB_TUPLE(0x338U, 29),     /*!< Low Power CMP 1 (PRTN1_COFB2) */
#endif                                                /* FSL_FEATURE_SOC_LPCMP_COUNT */
    kCLOCK_TempSensor = MC_ME_COFB_TUPLE(0x338U, 31), /*!< TMU Temperature Sensor Unit (PRTN1_COFB2) */
    /* PRTN1_COFB3_CLKEN Bit Fields */
    kCLOCK_Crc0 = MC_ME_COFB_TUPLE(0x33CU, 0), /*!< CRC (PRTN1_COFB3) */
#if defined(FSL_FEATURE_MC_ME_HAS_PRTN2) && (FSL_FEATURE_MC_ME_HAS_PRTN2 != 0U)
    /* PRTN2_COFB0_CLKEN Bit Fields */
    kCLOCK_Tcd12  = MC_ME_COFB_TUPLE(0x530U, 4),  /*!< EDMA transfer control descriptor 12 (PRTN2_COFB0) */
    kCLOCK_Tcd13  = MC_ME_COFB_TUPLE(0x530U, 5),  /*!< EDMA transfer control descriptor 13 (PRTN2_COFB0) */
    kCLOCK_Tcd14  = MC_ME_COFB_TUPLE(0x530U, 6),  /*!< EDMA transfer control descriptor 14 (PRTN2_COFB0) */
    kCLOCK_Tcd15  = MC_ME_COFB_TUPLE(0x530U, 7),  /*!< EDMA transfer control descriptor 15 (PRTN2_COFB0) */
    kCLOCK_Tcd16  = MC_ME_COFB_TUPLE(0x530U, 8),  /*!< EDMA transfer control descriptor 16 (PRTN2_COFB0) */
    kCLOCK_Tcd17  = MC_ME_COFB_TUPLE(0x530U, 9),  /*!< EDMA transfer control descriptor 17 (PRTN2_COFB0) */
    kCLOCK_Tcd18  = MC_ME_COFB_TUPLE(0x530U, 10), /*!< EDMA transfer control descriptor 18 (PRTN2_COFB0) */
    kCLOCK_Tcd19  = MC_ME_COFB_TUPLE(0x530U, 11), /*!< EDMA transfer control descriptor 19 (PRTN2_COFB0) */
    kCLOCK_Tcd20  = MC_ME_COFB_TUPLE(0x530U, 12), /*!< EDMA transfer control descriptor 20 (PRTN2_COFB0) */
    kCLOCK_Tcd21  = MC_ME_COFB_TUPLE(0x530U, 13), /*!< EDMA transfer control descriptor 21 (PRTN2_COFB0) */
    kCLOCK_Tcd22  = MC_ME_COFB_TUPLE(0x530U, 14), /*!< EDMA transfer control descriptor 22 (PRTN2_COFB0) */
    kCLOCK_Tcd23  = MC_ME_COFB_TUPLE(0x530U, 15), /*!< EDMA transfer control descriptor 23 (PRTN2_COFB0) */
    kCLOCK_Tcd24  = MC_ME_COFB_TUPLE(0x530U, 16), /*!< EDMA transfer control descriptor 24 (PRTN2_COFB0) */
    kCLOCK_Tcd25  = MC_ME_COFB_TUPLE(0x530U, 17), /*!< EDMA transfer control descriptor 25 (PRTN2_COFB0) */
    kCLOCK_Tcd26  = MC_ME_COFB_TUPLE(0x530U, 18), /*!< EDMA transfer control descriptor 26 (PRTN2_COFB0) */
    kCLOCK_Tcd27  = MC_ME_COFB_TUPLE(0x530U, 19), /*!< EDMA transfer control descriptor 27 (PRTN2_COFB0) */
    kCLOCK_Tcd28  = MC_ME_COFB_TUPLE(0x530U, 20), /*!< EDMA transfer control descriptor 28 (PRTN2_COFB0) */
    kCLOCK_Tcd29  = MC_ME_COFB_TUPLE(0x530U, 21), /*!< EDMA transfer control descriptor 29 (PRTN2_COFB0) */
    kCLOCK_Tcd30  = MC_ME_COFB_TUPLE(0x530U, 22), /*!< EDMA transfer control descriptor 30 (PRTN2_COFB0) */
    kCLOCK_Tcd31  = MC_ME_COFB_TUPLE(0x530U, 23), /*!< EDMA transfer control descriptor 31 (PRTN2_COFB0) */
    kCLOCK_Sema42 = MC_ME_COFB_TUPLE(0x530U, 24), /*!< Semaphores2 (PRTN2_COFB0) */
    kCLOCK_Stm1   = MC_ME_COFB_TUPLE(0x530U, 29), /*!< System Timer Module 1 (PRTN2_COFB0) */
    /* PRTN2_COFB1_CLKEN Bit Fields */
    kCLOCK_Emac     = MC_ME_COFB_TUPLE(0x534U, 0),   /*!< EMAC (PRTN2_COFB1) */
    kCLOCK_Lpuart8  = MC_ME_COFB_TUPLE(0x534U, 3U),  /*!< Low Power UART 8 (PRTN2_COFB1). */
    kCLOCK_Lpuart9  = MC_ME_COFB_TUPLE(0x534U, 4U),  /*!< Low Power UART 9 (PRTN2_COFB1). */
    kCLOCK_Lpuart10 = MC_ME_COFB_TUPLE(0x534U, 5U),  /*!< Low Power UART 10 (PRTN2_COFB1). */
    kCLOCK_Lpuart11 = MC_ME_COFB_TUPLE(0x534U, 6U),  /*!< Low Power UART 11 (PRTN2_COFB1). */
    kCLOCK_Lpuart12 = MC_ME_COFB_TUPLE(0x534U, 7U),  /*!< Low Power UART 12 (PRTN2_COFB1). */
    kCLOCK_Lpuart13 = MC_ME_COFB_TUPLE(0x534U, 8U),  /*!< Low Power UART 13 (PRTN2_COFB1). */
    kCLOCK_Lpuart14 = MC_ME_COFB_TUPLE(0x534U, 9U),  /*!< Low Power UART 14 (PRTN2_COFB1). */
    kCLOCK_Lpuart15 = MC_ME_COFB_TUPLE(0x534U, 10U), /*!< Low Power UART 15 (PRTN2_COFB1). */
    kCLOCK_Lpspi4   = MC_ME_COFB_TUPLE(0x534U, 15U), /*!< Low Power SPI 4 (PRTN2_COFB1). */
    kCLOCK_Lpspi5   = MC_ME_COFB_TUPLE(0x534U, 16U), /*!< Low Power SPI 5 (PRTN2_COFB1). */
    kCLOCK_Qspi     = MC_ME_COFB_TUPLE(0x534U, 19),  /*!< QuadSPI (PRTN2_COFB1) */
    kCLOCK_Sai1     = MC_ME_COFB_TUPLE(0x534U, 23),  /*!< Synchronous Audio Interface 1 (PRTN2_COFB1) */
    kCLOCK_Lpcmp2   = MC_ME_COFB_TUPLE(0x534U, 26),  /*!< Low Power CMP 2 (PRTN2_COFB1) */
    kCLOCK_Tcm0     = MC_ME_COFB_TUPLE(0x534U, 30),  /*!< Core0 TCM (PRTN2_COFB1) */
    kCLOCK_Tcm1     = MC_ME_COFB_TUPLE(0x534U, 31),  /*!< Core1 TCM (PRTN2_COFB1) */
#endif                                               /* FSL_FEATURE_MC_ME_HAS_PRTN2 */
} clock_ip_name_t;

