zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE31B/drivers/fsl_clock.h
#define CLOCK_DIV_TUPLE(mux, dc) ((mux << 8U) | dc)
#define CLOCK_TUPLE_DIV_DC_REG(tuple)                                                                \
    (*((volatile uint32_t *)((uint32_t)(&(MC_CGM->MUX_0_DC_0)) + ((tuple & 0xFF00U) >> 8U) * 0x40U + \
                             (tuple & 0xFF) * 4U)))
#define CLOCK_TUPLE_DIV_UPD_STAT_REG(tuple) \
    (*((volatile uint32_t *)((uint32_t)(&(MC_CGM->MUX_0_DIV_UPD_STAT)) + ((tuple & 0xFF00U) >> 8U) * 0x40U)))

/* clock mux, dc0-6 */
/*! @brief Clock dividers */
typedef enum _clock_div_name
{
    kCLOCK_DivCoreClk     = CLOCK_DIV_TUPLE(0U, 0U),      /*!< CLOCK MUX0, divider control 0. */
    kCLOCK_DivAipsPlatClk = CLOCK_DIV_TUPLE(0U, 1U),      /*!< CLOCK MUX0, divider control 1. */
    kCLOCK_DivAipsSlowClk = CLOCK_DIV_TUPLE(0U, 2U),      /*!< CLOCK MUX0, divider control 2. */
    kCLOCK_DivHseClk      = CLOCK_DIV_TUPLE(0U, 3U),      /*!< CLOCK MUX0, divider control 3. */
    kCLOCK_DivDcmClk      = CLOCK_DIV_TUPLE(0U, 4U),      /*!< CLOCK MUX0, divider control 4. */
#if defined(FSL_FEATURE_MC_CGM_HAS_LBIST_CLK_DIV) && (FSL_FEATURE_MC_CGM_HAS_LBIST_CLK_DIV != 0U)
    kCLOCK_DivLbistClk = CLOCK_DIV_TUPLE(0U, 5U),         /*!< CLOCK MUX0, divider control 5. */
#endif                                                    /* FSL_FEATURE_MC_CGM_HAS_LBIST_CLK_DIV */
#if defined(FSL_FEATURE_CLOCK_HAS_QSPI) && (FSL_FEATURE_CLOCK_HAS_QSPI != 0U)
    kCLOCK_DivQspiClk = CLOCK_DIV_TUPLE(0U, 6U),          /*!< CLOCK MUX0, divider control 6. */
#endif                                                    /* FSL_FEATURE_CLOCK_HAS_QSPI */
    kCLOCK_DivStm0Clk = CLOCK_DIV_TUPLE(1U, 0U),          /*!< CLOCK MUX1, divider control 0. */
#if defined(FSL_FEATURE_MC_CGM_HAS_MUX_2) && (FSL_FEATURE_MC_CGM_HAS_MUX_2 != 0U)
    kCLOCK_DivStm1Clk = CLOCK_DIV_TUPLE(2U, 0U),          /*!< CLOCK MUX2, divider control 0. */
#endif                                                    /* FSL_FEATURE_MC_CGM_HAS_MUX_2 */
    kCLOCK_DivFlexcan012PeClk = CLOCK_DIV_TUPLE(3U, 0U),  /*!< CLOCK MUX3, divider control 0. */
#if defined(FSL_FEATURE_MC_CGM_HAS_MUX_4) && (FSL_FEATURE_MC_CGM_HAS_MUX_4 != 0U)
    kCLOCK_DivFlexcan345PeClk = CLOCK_DIV_TUPLE(4U, 0U),  /*!< CLOCK MUX4, divider control 0. */
#endif                                                    /* FSL_FEATURE_MC_CGM_HAS_MUX_4 */
    kCLOCK_DivClkoutStandbyClk = CLOCK_DIV_TUPLE(5U, 0U), /*!< CLOCK MUX5, divider control 0. */
    kCLOCK_DivClkoutRunClk     = CLOCK_DIV_TUPLE(6U, 0U), /*!< CLOCK MUX6, divider control 0. */
#if defined(FSL_FEATURE_CLOCK_HAS_EMAC) && (FSL_FEATURE_CLOCK_HAS_EMAC != 0U)
    kCLOCK_DivEmacRxClk = CLOCK_DIV_TUPLE(7U, 0U),        /*!< CLOCK MUX7, divider control 0. */
    kCLOCK_DivEmacTxClk = CLOCK_DIV_TUPLE(8U, 0U),        /*!< CLOCK MUX8, divider control 0. */
    kCLOCK_DivEmacTsClk = CLOCK_DIV_TUPLE(9U, 0U),        /*!< CLOCK MUX9, divider control 0. */
#endif                                                    /* FSL_FEATURE_CLOCK_HAS_EMAC */
#if defined(FSL_FEATURE_CLOCK_HAS_QSPI) && (FSL_FEATURE_CLOCK_HAS_QSPI != 0U)
    kCLOCK_DivQspiSfckClk = CLOCK_DIV_TUPLE(10U, 0U),     /*!< CLOCK MUX10, divider control 0. */
#endif                                                    /* FSL_FEATURE_CLOCK_HAS_QSPI */
    kCLOCK_DivTraceClk = CLOCK_DIV_TUPLE(11U, 0U),        /*!< CLOCK MUX11, divider control 0. */
} clock_div_name_t;

#define CLOCK_TUPLE_MUX_CSC_REG(tuple) \
    (*((volatile uint32_t *)((uint32_t)(&(MC_CGM->MUX_0_CSC)) + ((tuple & 0xFF00U) >> 8U) * 0x40U)))
#define CLOCK_TUPLE_MUX_CSS_REG(tuple) \
    (*((volatile uint32_t *)((uint32_t)(&(MC_CGM->MUX_0_CSS)) + ((tuple & 0xFF00U) >> 8U) * 0x40U)))

/*!
 * @brief The enumerator of clock attach Id.
 */
typedef enum _clock_attach_id
{
    kFIRC_CLK_to_MUX0 = CLOCK_DIV_TUPLE(0U, CLOCK_FIRC_CLK),   /*!< Select FIRC as CLOCK MUX0 clock source. */
    kPLL_PHI0_CLK_to_MUX0 =
        CLOCK_DIV_TUPLE(0U, CLOCK_PLL_PHI0_CLK),               /*!< Select PLL_PHI0_CLK as CLOCK MUX0 clock source. */

    kFIRC_CLK_to_STM0  = CLOCK_DIV_TUPLE(1U, CLOCK_FIRC_CLK),  /*!< Select FIRC as STM0 clock source. */
    kFXOSC_CLK_to_STM0 = CLOCK_DIV_TUPLE(1U, CLOCK_FXOSC_CLK), /*!< Select FXOSC as STM0 clock source. */
    kAIPS_PLAT_CLK_to_STM0 =
        CLOCK_DIV_TUPLE(1U, CLOCK_AIPS_PLAT_CLK),              /*!< Select AIPS_PLAT_CLK as STM0 clock source. */

#if defined(FSL_FEATURE_MC_CGM_HAS_MUX_2) && (FSL_FEATURE_MC_CGM_HAS_MUX_2 != 0U)
    kFIRC_CLK_to_STM1  = CLOCK_DIV_TUPLE(2U, CLOCK_FIRC_CLK),  /*!< Select FIRC as STM1 clock source. */
    kFXOSC_CLK_to_STM1 = CLOCK_DIV_TUPLE(2U, CLOCK_FXOSC_CLK), /*!< Select FXOSC as STM1 clock source. */
    kAIPS_PLAT_CLK_to_STM1 =
        CLOCK_DIV_TUPLE(2U, CLOCK_AIPS_PLAT_CLK),              /*!< Select AIPS_PLAT_CLK as STM1 clock source. */
#endif                                                         /* FSL_FEATURE_MC_CGM_HAS_MUX_2 */

    kFIRC_CLK_to_FLEXCAN012_PE =
        CLOCK_DIV_TUPLE(3U, CLOCK_FIRC_CLK),      /*!< Select FIRC as FLEXCAN0,1,2_PE clock source. */
    kFXOSC_CLK_to_FLEXCAN012_PE =
        CLOCK_DIV_TUPLE(3U, CLOCK_FXOSC_CLK),     /*!< Select FXOSC as FLEXCAN0,1,2_PE clock source. */
    kAIPS_PLAT_CLK_to_FLEXCAN012_PE =
        CLOCK_DIV_TUPLE(3U, CLOCK_AIPS_PLAT_CLK), /*!< Select AIPS_PLAT_CLK as FLEXCAN0,1,2_PE clock source. */

#if defined(FSL_FEATURE_MC_CGM_HAS_MUX_4) && (FSL_FEATURE_MC_CGM_HAS_MUX_4 != 0U)
    kFIRC_CLK_to_FLEXCAN345_PE =
        CLOCK_DIV_TUPLE(4U, CLOCK_FIRC_CLK),      /*!< Select FIRC as FLEXCAN3,4,5_PE clock source. */
    kFXOSC_CLK_to_FLEXCAN345_PE =
        CLOCK_DIV_TUPLE(4U, CLOCK_FXOSC_CLK),     /*!< Select FXOSC as FLEXCAN3,4,5_PE clock source. */
    kAIPS_PLAT_CLK_to_FLEXCAN345_PE =
        CLOCK_DIV_TUPLE(4U, CLOCK_AIPS_PLAT_CLK), /*!< Select AIPS_PLAT_CLK as FLEXCAN3,4,5_PE clock source. */
#endif                                            /* FSL_FEATURE_MC_CGM_HAS_MUX_4 */

    kFIRC_CLK_to_CLKOUT_STANDBY =
        CLOCK_DIV_TUPLE(5U, CLOCK_FIRC_CLK),  /*!< Select FIRC as CLKOUT_STANDBY mode clock source. */
    kSIRC_CLK_to_CLKOUT_STANDBY =
        CLOCK_DIV_TUPLE(5U, CLOCK_SIRC_CLK),  /*!< Select SIRC as CLKOUT_STANDBY mode clock source. */
    kFXOSC_CLK_to_CLKOUT_STANDBY =
        CLOCK_DIV_TUPLE(5U, CLOCK_FXOSC_CLK), /*!< Select FXOSC as CLKOUT_STANDBY mode clock source. */
#if defined(FSL_FEATURE_MC_CGM_HAS_SXOSC) && (FSL_FEATURE_MC_CGM_HAS_SXOSC != 0U)
    kSXOSC_CLK_to_CLKOUT_STANDBY =
        CLOCK_DIV_TUPLE(5U, CLOCK_SXOSC_CLK),     /*!< Select SXOSC as CLKOUT_STANDBY mode clock source. */
#endif                                            /* FSL_FEATURE_MC_CGM_HAS_SXOSC */
    kAIPS_SLOW_CLK_to_CLKOUT_STANDBY =
        CLOCK_DIV_TUPLE(5U, CLOCK_AIPS_SLOW_CLK), /*!< Select AIPS_SLOW_CLK as CLKOUT_STANDBY mode clock source. */

    kFIRC_CLK_to_CLKOUT_RUN = CLOCK_DIV_TUPLE(6U, CLOCK_FIRC_CLK), /*!< Select FIRC as CLKOUT_RUN mode clock source. */
    kSIRC_CLK_to_CLKOUT_RUN = CLOCK_DIV_TUPLE(6U, CLOCK_SIRC_CLK), /*!< Select SIRC as CLKOUT_RUN mode clock source. */
    kFXOSC_CLK_to_CLKOUT_RUN =
        CLOCK_DIV_TUPLE(6U, CLOCK_FXOSC_CLK),                      /*!< Select FXOSC as CLKOUT_RUN mode clock source. */
#if defined(FSL_FEATURE_MC_CGM_HAS_SXOSC) && (FSL_FEATURE_MC_CGM_HAS_SXOSC != 0U)
    kSXOSC_CLK_to_CLKOUT_RUN =
        CLOCK_DIV_TUPLE(6U, CLOCK_SXOSC_CLK),    /*!< Select SXOSC as CLKOUT_RUN mode clock source. */
#endif                                           /* FSL_FEATURE_MC_CGM_HAS_SXOSC */
    kPLL_PHI0_CLK_to_CLKOUT_RUN =
        CLOCK_DIV_TUPLE(6U, CLOCK_PLL_PHI0_CLK), /*!< Select PLL_PHI0_CLK as CLKOUT_RUN mode clock source. */
    kPLL_PHI1_CLK_to_CLKOUT_RUN =
        CLOCK_DIV_TUPLE(6U, CLOCK_PLL_PHI1_CLK), /*!< Select PLL_PHI1_CLK as CLKOUT_RUN mode clock source. */
    kCORE_CLK_to_CLKOUT_RUN =
        CLOCK_DIV_TUPLE(6U, CLOCK_CORE_CLK),     /*!< Select CORE_CLK as CLKOUT_RUN mode clock source. */
    kHSE_CLK_to_CLKOUT_RUN = CLOCK_DIV_TUPLE(6U, CLOCK_HSE_CLK), /*!< Select HSE_CLK as CLKOUT_RUN mode clock source. */
    kAIPS_PLAT_CLK_to_CLKOUT_RUN =
        CLOCK_DIV_TUPLE(6U, CLOCK_AIPS_PLAT_CLK), /*!< Select AIPS_PLAT as CLKOUT_RUN mode clock source. */
    kAIPS_SLOW_CLK_to_CLKOUT_RUN =
        CLOCK_DIV_TUPLE(6U, CLOCK_AIPS_SLOW_CLK), /*!< Select AIPS_SLOW as CLKOUT_RUN mode clock source. */
#if defined(FSL_FEATURE_CLOCK_HAS_EMAC) && (FSL_FEATURE_CLOCK_HAS_EMAC != 0U)
    kEMAC_RMII_TX_CLK_to_CLKOUT_RUN = CLOCK_DIV_TUPLE(
        6U, CLOCK_EMAC_RMII_TX_CLK),            /*!< Select EMAC_RMII_TX_CLK(pin) as CLKOUT_RUN mode clock source. */
    kEMAC_RX_CLK_to_CLKOUT_RUN =
        CLOCK_DIV_TUPLE(6U, CLOCK_EMAC_RX_CLK), /*!< Select EMAC_RX_CLK(pin) as CLKOUT_RUN mode clock source. */

    kFIRC_CLK_to_EMAC_RX = CLOCK_DIV_TUPLE(7U, CLOCK_FIRC_CLK), /*!< Select FIRC as EMAC_RX_CLK clock source. */
    kEMAC_RMII_TX_CLK_to_EMAC_RX =
        CLOCK_DIV_TUPLE(7U, CLOCK_EMAC_RMII_TX_CLK), /*!< Select EMAC_RMII_TX_CLK(pin) as EMAC_RX_CLK  clock source. */
    kEMAC_RX_CLK_to_EMAC_RX =
        CLOCK_DIV_TUPLE(7U, CLOCK_EMAC_RX_CLK),      /*!< Select EMAC_RX_CLK(pin) as EMAC_RX_CLK clock source. */

    kFIRC_CLK_to_EMAC_TX = CLOCK_DIV_TUPLE(8U, CLOCK_FIRC_CLK), /*!< Select FIRC as EMAC_TX_CLK clock source. */
    kEMAC_RMII_TX_CLK_to_EMAC_TX =
        CLOCK_DIV_TUPLE(8U, CLOCK_EMAC_RMII_TX_CLK), /*!< Select EMAC_RMII_TX_CLK(pin) as EMAC_TX_CLK  clock source. */

    kFIRC_CLK_to_EMAC_TS  = CLOCK_DIV_TUPLE(9U, CLOCK_FIRC_CLK),  /*!< Select FIRC as EMAC_TS_CLK clock source. */
    kFXOSC_CLK_to_EMAC_TS = CLOCK_DIV_TUPLE(9U, CLOCK_FXOSC_CLK), /*!< Select FXOSC as EMAC_TS_CLK clock source. */
    kPLL_PHI0_CLK_to_EMAC_TS =
        CLOCK_DIV_TUPLE(9U, CLOCK_PLL_PHI0_CLK),     /*!< Select PLL_PHI0_CLK as EMAC_TS_CLK clock source. */
    kEMAC_RMII_TX_CLK_to_EMAC_TS =
        CLOCK_DIV_TUPLE(9U, CLOCK_EMAC_RMII_TX_CLK), /*!< Select EMAC_RMII_TX_CLK(pin) as EMAC_TS_CLK  clock source. */
    kEMAC_RX_CLK_to_EMAC_TS =
        CLOCK_DIV_TUPLE(9U, CLOCK_EMAC_RX_CLK),      /*!< Select EMAC_RX_CLK(pin) as EMAC_TS_CLK clock source. */
#endif                                               /* FSL_FEATURE_CLOCK_HAS_EMAC */

#if defined(FSL_FEATURE_CLOCK_HAS_QSPI) && (FSL_FEATURE_CLOCK_HAS_QSPI != 0U)
    kFIRC_CLK_to_QSPI_SFCK  = CLOCK_DIV_TUPLE(10U, CLOCK_FIRC_CLK),  /*!< Select FIRC as QSPI_SFCK clock source. */
    kFXOSC_CLK_to_QSPI_SFCK = CLOCK_DIV_TUPLE(10U, CLOCK_FXOSC_CLK), /*!< Select FXOSC as QSPI_SFCK clock source. */
    kPLL_PHI1_CLK_to_QSPI_SFCK =
        CLOCK_DIV_TUPLE(10U, CLOCK_PLL_PHI1_CLK),                /*!< Select PLL_PHI1_CLK as QSPI_SFCK clock source. */
#endif                                                           /* FSL_FEATURE_CLOCK_HAS_QSPI */

    kFIRC_CLK_to_TRACE  = CLOCK_DIV_TUPLE(11U, CLOCK_FIRC_CLK),  /*!< Select FIRC as TRACE clock source. */
    kFXOSC_CLK_to_TRACE = CLOCK_DIV_TUPLE(11U, CLOCK_FXOSC_CLK), /*!< Select FXOSC as TRACE clock source. */
    kPLL_PHI0_CLK_to_TRACE =
        CLOCK_DIV_TUPLE(11U, CLOCK_PLL_PHI0_CLK),                /*!< Select PLL_PHI0_CLK as TRACE clock source. */
    kPLL_PHI1_CLK_to_TRACE =
        CLOCK_DIV_TUPLE(11U, CLOCK_PLL_PHI1_CLK),                /*!< Select PLL_PHI1_CLK as TRACE clock source. */

} clock_attach_id_t;

/*!
 * @brief Clock name.
 */
typedef enum _clock_name
{
    /* --------------------- System layer clock --------------------- */
    kCLOCK_CoreSysClk,  /*!< Core clock.   */
    kCLOCK_AipsPlatClk, /*!< AIPS_PLAT clock. */
    kCLOCK_AipsSlowClk, /*!< AIPS_SLOW clock. */
    kCLOCK_HseClk,      /*!< HSE clock. */
    kCLOCK_DcmClk,      /*!< DCM clock. */
#if defined(FSL_FEATURE_MC_CGM_HAS_LBIST_CLK_DIV) && (FSL_FEATURE_MC_CGM_HAS_LBIST_CLK_DIV != 0U)
    kCLOCK_LbistClk,    /*!< LBIST clock. */
#endif                  /* FSL_FEATURE_MC_CGM_HAS_LBIST_CLK_DIV */
#if defined(FSL_FEATURE_CLOCK_HAS_QSPI) && (FSL_FEATURE_CLOCK_HAS_QSPI != 0U)
    kCLOCK_QspiClk,     /*!< QSPI clock. */
#endif                  /* FSL_FEATURE_CLOCK_HAS_QSPI */

    /* --------------------- MC_CGM clock --------------------- */
    kCLOCK_FircClk,    /*!< Firc clock. */
    kCLOCK_SircClk,    /*!< SIRC clock. */
    kCLOCK_FxoscClk,   /*!< FXOSC clock. */
#if defined(FSL_FEATURE_MC_CGM_HAS_SXOSC) && (FSL_FEATURE_MC_CGM_HAS_SXOSC != 0U)
    kCLOCK_SxoscClk,   /*!< SXOSC clock. */
#endif                 /* FSL_FEATURE_MC_CGM_HAS_SXOSC */
    kCLOCK_PllPhi0Clk, /*!< PLL_PHI0_CLK clock. */
    kCLOCK_PllPhi1Clk, /*!< PLL_PHI0_CLK clock. */

    /* --------------------- Peripheral clock --------------------- */
    kCLOCK_Adc0Clk,     /*!< ADC0 clock. */
    kCLOCK_Adc1Clk,     /*!< ADC1 clock. */
#if defined(FSL_FEATURE_SOC_ADC_COUNT) && (FSL_FEATURE_SOC_ADC_COUNT > 2U)
    kCLOCK_Adc2Clk,     /*!< ADC2 clock. */
#endif                  /* FSL_FEATURE_SOC_ADC_COUNT */
    kCLOCK_BctuClk,     /*!< Bctu clock. */
    kCLOCK_Cmp0Clk,     /*!< CMP0 clock. */
#if defined(FSL_FEATURE_SOC_LPCMP_COUNT) && (FSL_FEATURE_SOC_LPCMP_COUNT > 1U)
    kCLOCK_Cmp1Clk,     /*!< CMP1 clock. */
#endif                  /* FSL_FEATURE_SOC_LPCMP_COUNT */
#if defined(FSL_FEATURE_SOC_LPCMP_COUNT) && (FSL_FEATURE_SOC_LPCMP_COUNT > 2U)
    kCLOCK_Cmp2Clk,     /*!< CMP2 clock. */
#endif                  /* FSL_FEATURE_SOC_LPCMP_COUNT */
    kCLOCK_EmiosClk,    /*!< EMIOS clock. */
    kCLOCK_Flexcan0Clk, /*!< FLEXCAN0/1/2_PE clock. */
    kCLOCK_Flexcan1Clk, /*!< FLEXCAN0/1/2_PE clock. */
    kCLOCK_Flexcan2Clk, /*!< FLEXCAN0/1/2_PE clock. */
#if defined(FSL_FEATURE_SOC_FLEXCAN_COUNT) && (FSL_FEATURE_SOC_FLEXCAN_COUNT > 3U)
    kCLOCK_Flexcan3Clk, /*!< FLEXCAN3/4/5_PE clock. */
    kCLOCK_Flexcan4Clk, /*!< FLEXCAN3/4/5_PE clock. */
    kCLOCK_Flexcan5Clk, /*!< FLEXCAN3/4/5_PE clock. */
#endif                  /* FSL_FEATURE_SOC_FLEXCAN_COUNT */
    kCLOCK_FlexioClk,   /*!< FLEXIO clock. */

