zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE31B/drivers/fsl_clock.h
    kCLOCK_Lpi2c0Clk,   /*!< LPI2C0 clock. */
    kCLOCK_Lpi2c1Clk,   /*!< LPI2C0 clock. */

    kCLOCK_Lpspi0Clk,   /*!< LPSPI0 clock. */
    kCLOCK_Lpspi1Clk,   /*!< LPSPI1 clock. */
    kCLOCK_Lpspi2Clk,   /*!< LPSPI2 clock. */
    kCLOCK_Lpspi3Clk,   /*!< LPSPI3 clock. */
#if defined(FSL_FEATURE_SOC_LPSPI_COUNT) && (FSL_FEATURE_SOC_LPSPI_COUNT > 4U)
    kCLOCK_Lpspi4Clk,   /*!< LPSPI4 clock. */
    kCLOCK_Lpspi5Clk,   /*!< LPSPI5 clock. */
#endif                  /* FSL_FEATURE_SOC_LPSPI_COUNT */

    kCLOCK_Lpuart0Clk,  /*!< LPUART0 clock. */
    kCLOCK_Lpuart1Clk,  /*!< LPUART1 clock. */
    kCLOCK_Lpuart2Clk,  /*!< LPUART2 clock. */
    kCLOCK_Lpuart3Clk,  /*!< LPUART3 clock. */
#if defined(FSL_FEATURE_SOC_LPUART_COUNT) && (FSL_FEATURE_SOC_LPUART_COUNT > 4U)
    kCLOCK_Lpuart4Clk,  /*!< LPUART4 clock. */
    kCLOCK_Lpuart5Clk,  /*!< LPUART5 clock. */
    kCLOCK_Lpuart6Clk,  /*!< LPUART6 clock. */
    kCLOCK_Lpuart7Clk,  /*!< LPUART7 clock. */
#endif                  /* FSL_FEATURE_SOC_LPUART_COUNT */
#if defined(FSL_FEATURE_SOC_LPUART_COUNT) && (FSL_FEATURE_SOC_LPUART_COUNT > 8U)
    kCLOCK_Lpuart8Clk,  /*!< LPUART8 clock. */
    kCLOCK_Lpuart9Clk,  /*!< LPUART9 clock. */
    kCLOCK_Lpuart10Clk, /*!< LPUART10 clock. */
    kCLOCK_Lpuart11Clk, /*!< LPUART11 clock. */
    kCLOCK_Lpuart12Clk, /*!< LPUART12 clock. */
    kCLOCK_Lpuart13Clk, /*!< LPUART13 clock. */
    kCLOCK_Lpuart14Clk, /*!< LPUART14 clock. */
    kCLOCK_Lpuart15Clk, /*!< LPUART15 clock. */
#endif                  /* FSL_FEATURE_SOC_LPUART_COUNT */

    kCLOCK_Pit0Clk,     /*!< PIT0 clock. */
    kCLOCK_Pit1Clk,     /*!< PIT1 clock. */
#if defined(FSL_FEATURE_SOC_PIT_COUNT) && (FSL_FEATURE_SOC_PIT_COUNT > 2U)
    kCLOCK_Pit2Clk,     /*!< PIT2 clock. */
#endif                  /* FSL_FEATURE_SOC_PIT_COUNT */

#if defined(FSL_FEATURE_SOC_I2S_COUNT) && (FSL_FEATURE_SOC_I2S_COUNT != 0U)
    kCLOCK_Sai0Clk, /*!< SAI0 clock. */
    kCLOCK_Sai1Clk, /*!< SAI0 clock. */
#endif

    kCLOCK_Stm0Clk, /*!< STM0 clock. */
#if defined(FSL_FEATURE_SOC_STM_COUNT) && (FSL_FEATURE_SOC_STM_COUNT > 1U)
    kCLOCK_Stm1Clk, /*!< STM0 clock. */
#endif              /* FSL_FEATURE_SOC_STM_COUNT */

#if defined(FSL_FEATURE_MC_ME_HAS_PRTN2) && (FSL_FEATURE_MC_ME_HAS_PRTN2 != 0U)
    kCLOCK_QspiSfClk, /*!< QSPI_SF clock. */
    kCLOCK_EmacRxClk, /*!< EMAC RX clock. */
    kCLOCK_EmacTxClk, /*!< EMAC TX clock. */
    kCLOCK_EmacTsClk, /*!< EMAC TS clock. */
#endif                /* FSL_FEATURE_MC_ME_HAS_PRTN2 */
} clock_name_t;

/** @brief Clock ip trigger divider type. */
typedef enum _clock_trigger_div_type
{
    KCLOCK_ImmediateUpdate     = 0U, /*!< Immediate divider update. */
    KCLOCK_CommonTriggerUpdate = 1U, /*!< Common trigger divider update.  */

} clock_trigger_div_type_t;

/** @brief Clock switch trigger source. */
typedef enum _clock_switch_trigger_src
{
    kCLOCK_SwitchReserved      = 0U, /*!< Reserved.  */
    kCLOCK_SwitchSuccessPerReq = 1U, /*!< Common trigger divider update.  */
    kCLOCK_SwitchFailedInactiveTarget =
        2U, /*!< Switch after the request failed because of an inactive target clock and the current clock is FIRC. */
    kCLOCK_SwitchFailedInactiveCurrent =
        3U, /*!< Switch after the request failed because of an inactive current clock and the current clock is FIRC.*/
    kCLOCK_SwitchSafeReq               = 4U, /*!< Switch to FIRC because of a safe clock request or reset succeeded.  */
    kCLOCK_SwitchSafeReqInactivePreClk = 5U, /*!< Switch to FIRC because of a safe clock request or reset succeeded, but
                                                the previous current clock source was inactive. */
} clock_switch_trigger_src_t;

/*! @brief The FIRC divider. */
typedef enum clock_firc_div
{
    kFIRC_DividedBy2  = 1U, /*!< FIRC clock divided by 2. */
    kFIRC_DividedBy16 = 2U, /*!< FIRC clock divided by 16. */
    kFIRC_Undivided   = 3U, /*!< FIRC clock undivided. */
} clock_firc_div_t;

/*! @brief The FXOSC work mode. */
typedef enum _fxosc_mode
{
    kFXOSC_ModeCrystal = FXOSC_CTRL_COMP_EN_MASK,                           /*!< Crystal mode. */
    kFXOSC_ModeBypass  = FXOSC_CTRL_COMP_EN_MASK | FXOSC_CTRL_OSC_BYP_MASK, /*!< Use external clock.   */
} fxosc_mode_t;

/*!
 * @brief OSC Initialization Configuration Structure
 *
 * Defines the configuration data structure to initialize the FXOSC.
 */
typedef struct _fxosc_config
{
    uint32_t freqHz;       /*!< Frequency in Herz. */
    fxosc_mode_t workMode; /*!< FXOSC work mode setting.       */
    uint8_t startupDelay; /*!< Specifies the end-of-count. Runs on crystal clock divided by 4 and counts to startupDelay
                           * 128. */
    uint8_t overdriveProtect; /*! < Crystal overdrive protection. Depends on crystal spec, referring datasheet. */
} fxosc_config_t;

/*! @brief The PLL work mode. */
typedef enum pll_mode
{
    kPLL_ModeInteger = 0U, /*!< PLL operates in integer-only mode. */
    kPLL_ModeFractional,   /*!< PLL operates in fractional mode. */
    kPLL_ModeSSCG,         /*!< PLL operates in Frequency Modulation mode. */
} pll_mode_t;

/*! @brief The PLL unlock accuracy. */
typedef enum pll_unlock_accuracy
{
    kPLL_UnlockAccuracy9 =
        0U, /*!< Unlock range = Expected value deviates by 9 (recommended when PLLFM[SSCGBYP] = 1). */
    kPLL_UnlockAccuracy17 =
        1U, /*!< Unlock range = Expected value deviates by 17 (recommended when PLLFM[SSCGBYP] = 1). */
    kPLL_UnlockAccuracy33 = 2U, /*!< Unlock range = Expected value deviates by 33. */
    kPLL_UnlockAccuracy5  = 3U, /*!< Unlock range = Expected value deviates by 5. */
} pll_unlock_accuracy_t;

/*!
 * @brief PLL Initialization Configuration Structure
 *
 * Defines the configuration data structure to initialize the PLL.
 * When porting to a new board, set the following members
 */
typedef struct _pll_config
{
    pll_mode_t workMode;  /*!< PLL work mode setting.       */
    uint8_t preDiv;       /*!< Input Clock Predivider. */
    uint8_t postDiv;      /*!< VCO clock post divider for driving the PHI output clock. */

    uint8_t multiplier;   /*!< Multiplication factor applied to the reference frequency. */
    uint16_t fracLoopDiv; /*!< Numerator Of Fractional Loop Division Factor.Value should less than 18432. Used for
                             Fractional Mode only. */

    uint16_t stepSize;    /*!< For SSCG mode. Frequency Modulation Step Size. */
    uint16_t stepNum;     /*!< For SSCG mode. Number Of Steps Of Modulation Period Or Frequency Modulation. */

    pll_unlock_accuracy_t accuracy;    /*!< PLL unlock accuracy. */
    uint8_t outDiv[PLL_PLLODIV_COUNT]; /*!< PLL Output Divider. */
} pll_config_t;

/*!
 * @brief Clock Source PCFS configuration structure.
 */
typedef struct _clock_pcfs_config_t
{
    uint32_t maxAllowableIDDchange; /*!< Maximum variation of current per time (mA/microsec) -  max allowable IDD change
                                       is determined by the user's power supply design. */
    uint32_t stepDuration;          /*!< Step duration of each PCFS step (time per step in us). */
    uint32_t clkSrcFreq; /*!< Frequency of the clock source from which ramp-down and to which ramp-up are processed. */
} clock_pcfs_config_t;

