zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE31B/drivers/fsl_clock.h
/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/**
 * @brief Starts the hardware processes for the partition(s) clock change sequence.
 * @return  Nothing
 */
static inline void CLOCK_McmeEnterKey(void)
{
    MC_ME->CTL_KEY = MC_ME_CTL_KEY_KEY(0x5AF0U);
    MC_ME->CTL_KEY = MC_ME_CTL_KEY_KEY(0xA50FU);
}

#if defined(FSL_FEATURE_CLOCK_HAS_EMAC)
/**
 * @brief API used to tell clock driver the clock frequency on the EMAC_RMII_MII_TX_CLK pin.
 * @param freq Frequency in herz.
 * @return  Nothing
 */
void CLOCK_SetEmacRmiiTxClkFreq(uint32_t freq);

/**
 * @brief API used to tell clock driver the clock frequency on the EMAC_RX_CLK pin.
 * @param freq Frequency in herz.
 * @return  Nothing
 */
void CLOCK_SetEmacRxClkFreq(uint32_t freq);
#endif /* FSL_FEATURE_CLOCK_HAS_EMAC */

/**
 * @brief Enable the clock for specific IP.
 * @param clk : Clock to be enabled.
 * @return  kStatus_Sucess for suceessfully operation, kStatus_Timeout for timeout.
 */
status_t CLOCK_EnableClock(clock_ip_name_t clk);

/**
 * @brief Disable the clock for specific IP.
 * @param clk : Clock to be disabled.
*  @return  kStatus_Sucess for suceessfully operation, kStatus_Timeout for timeout.
 */
status_t CLOCK_DisableClock(clock_ip_name_t clk);

/**
 * @brief   Setup peripheral clock dividers trigger type.
 * Selects whether the dividers associated with clock mux 0 are updated immediately on writing to the corresponding
 * divider configuration register (referred to as immediate divider update) or only on writing to the
 * MC_CGM_MUX_0_DIV_TRIG register (referred to as common trigger update)
 * @param   div_name    : Clock divider name
 * @param   type     : divider trigger type
 * @return  Nothing
 */
static inline void CLOCK_SetClkMux0DivTriggerType(clock_trigger_div_type_t type)
{
    if (type == KCLOCK_CommonTriggerUpdate)
    {
        MC_CGM->MUX_0_DIV_TRIG_CTRL |= MC_CGM_MUX_0_DIV_TRIG_CTRL_TCTL_MASK;
    }
    else
    {
        MC_CGM->MUX_0_DIV_TRIG_CTRL &= ~MC_CGM_MUX_0_DIV_TRIG_CTRL_TCTL_MASK;
    }
}

/**
 * @brief Trigger MUX0 clock dividers update(referred to as common trigger update).
 * When MC_CGM_MUX_0_DIV_TRIG_CTRL_TCTL = 1, use this API to trigger update for MUX0 dividers.
 * @return  kStatus_Timeout for timeout, kStatus_Success for sucees operation. 
 */
static inline status_t CLOCK_CommonTriggerClkMux0DivUpdate(void)
{
    MC_CGM->MUX_0_DIV_TRIG_CTRL = MC_CGM_MUX_0_DIV_TRIG_CTRL_TCTL_MASK | MC_CGM_MUX_0_DIV_TRIG_CTRL_HHEN_MASK;
    MC_CGM->MUX_0_DIV_TRIG      = MC_CGM_MUX_0_DIV_TRIG_TRIGGER(1u);

#if (CLOCK_RETRY_TIMES != 0U)
    uint32_t waitTimes = CLOCK_RETRY_TIMES;
#endif
    /* Trigger clock transition for MC_CGM_MUX0 */
    while ((MC_CGM->MUX_0_DIV_UPD_STAT & MC_CGM_MUX_0_DIV_UPD_STAT_DIV_STAT_MASK) != 0)
    {
#if (CLOCK_RETRY_TIMES != 0U)
        if (--waitTimes == 0U)
        {
            return kStatus_Timeout;
        }
#endif
    }

    return kStatus_Success;
}

/**
 * @brief   Setup FIRC clock divider.
 * @param   divider Value to be divided. Defined by clock_firc_div_t.
 * @retval kStatus_Success FIRC divider set succeed.
 * @retval kStatus_Fail FIRC divider set failed.
 */
status_t CLOCK_SetFircDiv(clock_firc_div_t divider);

/**
 * @brief   Setup peripheral clock dividers.
 * @param   div_name    : Clock divider name
 * @param   divider     : Value to be divided. Divider value 0 will disable the divider.
 * Undivided clock frequency / divider.
 * @return  kStatus_Sucess for suceessfully operation, kStatus_Timeout for timeout.
 */
status_t CLOCK_SetClkDiv(clock_div_name_t div_name, uint32_t divider);

/**
 * @brief Enable FIRC in standby mode.
 * @return  Nothing
 */
static inline void CLOCK_EnableFircInStandbyMode(void)
{
    FIRC->STDBY_ENABLE |= FIRC_STDBY_ENABLE_STDBY_EN_MASK;
}

/**
 * @brief Disable FIRC in standby mode.
 * @return  Nothing
 */
static inline void CLOCK_DisableFircInStandbyMode(void)
{
    FIRC->STDBY_ENABLE &= ~FIRC_STDBY_ENABLE_STDBY_EN_MASK;
}

/**
 * @brief Enable SIRC in standby mode.
 * @return  Nothing
 */
static inline void CLOCK_EnableSircInStandbyMode(void)
{
    SIRC->MISCELLANEOUS_IN |= SIRC_MISCELLANEOUS_IN_STANDBY_ENABLE_MASK;
}

/**
 * @brief Disable SIRC in standby mode.
 * @return  Nothing
 */
static inline void CLOCK_DisableSircInStandbyMode(void)
{
    SIRC->MISCELLANEOUS_IN &= ~SIRC_MISCELLANEOUS_IN_STANDBY_ENABLE_MASK;
}

/**
 * @brief Configure the clock selection muxes.
 * @param  connection  : Clock to be configured.
 * @return kStatus_Sucess for suceessfully operation, kStatus_Timeout for timeout.
 */
status_t CLOCK_AttachClk(clock_attach_id_t connection);

/**
 * @brief Request safe clock switch to FIRC.
 * @param  connection  : Clock to be configured.
 * @return kStatus_Sucess for suceessfully operation, kStatus_Timeout for timeout.
 */
status_t CLOCK_SelectSafeClock(clock_attach_id_t connection);

/**
 * @brief Configure the Progressive Clock Frequency Switch(PCFS) for MC_CGM MUX0.
 * @param  connection  : Clock to be configured. Only MUX_0 clock supports PCFS, kPLL_PHI0_CLK_to_MUX0.
 * @param  config : PCFS configuration.
 * @return kStatus_Sucess for suceessfully operation, kStatus_Timeout for timeout.
 */
status_t CLOCK_ProgressiveClockFrequencySwitch(clock_attach_id_t connection, clock_pcfs_config_t const *config);

/**
 * @brief Get the clock selection status.
 * @param  connection  : Clock to be configured.
 * @return  clock selection status
 */
uint32_t CLOCK_GetClkSelectState(clock_attach_id_t connection);

/**
 * @brief Get the clock switch trigger source for hardware-controlled selector.
 * @param  connection  : Clock to be configured.
 * @return  clock selection status @ref clock_switch_trigger_src_t.
 */
uint32_t CLOCK_GetClkSwitchTriggerCause(clock_attach_id_t connection);

/*!
 * @brief Initialize the FXOSC.
 * @code
 *   fxosc_config_t config =
 *   {
 *     .freqHz = 16000000U,
 *     .workMode = kFXOSC_ModeCrystal,
 *     .startupDelay = 49U,
 *     .overdriveProtect = 12U,
 *   };
 *
 *   CLOCK_InitFxosc(&config);
 * @endcode
 * @param config The FXOSC configuration structure, @ref fxosc_config_t.
 * @return kStatus_Sucess for suceessfully operation, kStatus_Timeout for timeout.
 */
status_t CLOCK_InitFxosc(const fxosc_config_t *config);

