zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE31B/drivers/fsl_clock.h
#if defined(FSL_FEATURE_MC_CGM_HAS_SXOSC) && (FSL_FEATURE_MC_CGM_HAS_SXOSC != 0U)
/*!
 * @brief Initialize the SXOSC.
 * @param enable Enable or disable the SXOSC.
 * @param startupDelay The oscillator counter runs on a divided crystal clock (divide by 4) and counts up to 128
times the EOCV value (EOCV * 128).
 * @return kStatus_Sucess for suceessfully operation, kStatus_Timeout for timeout.
 */
status_t CLOCK_InitSxosc(bool enable, uint8_t startupDelay);
#endif /* FSL_FEATURE_MC_CGM_HAS_SXOSC */

/*!
 * @brief Disable FXOSC.
 */
static inline void CLOCK_DinitFxosc(void)
{
    FXOSC->CTRL &= ~FXOSC_CTRL_OSCON_MASK;
    g_xtal0Freq = 0U;
}

/*!
 * @brief Initialize the PLL.
 * @code
 *   pll_config_t config =
 *   {
 *     .workMode = kPLL_ModeInteger,
 *     .preDiv = 2U,
 *     .postDiv = 2U,
 *     .multiplier = 120U,
 *     .accuracy = kPLL_UnlockAccuracy9,
 *     .outDiv[0] = 3U,
 *     .outDiv[1] = 3U,
 *   };
 *
 *   CLOCK_InitPll(&pllConfig);
 * @endcode
 * @param config The PLL configuration structure, @ref pll_config_t.
 */

status_t CLOCK_InitPll(const pll_config_t *config);

/*!
 * @brief Deinit and disable the PLL.
 */
static inline void CLOCK_DeinitPll(void)
{
    uint32_t i = 0U;
    for (i = 0U; i < PLL_PLLODIV_COUNT; i++)
    {
        PLL->PLLODIV[i] &= ~PLL_PLLODIV_DE_MASK;
    }

    PLL->PLLCR |= PLL_PLLCR_PLLPD_MASK;
}

/*!
 * @brief Check whether the PLL is loss of lock.
 * @return true: Loss of lock is detected, false: No loss of lock detected.
 */
static inline bool CLOCK_IsPllLossOfLock(void)
{
    return ((PLL->PLLSR & PLL_PLLSR_LOL_MASK) != 0U) ? true : false;
}

/*!
 * @brief Gets the clock frequency for a specific clock name.
 *
 * This function checks the current clock configurations and then calculates
 * the clock frequency for a specific clock name defined in clock_name_t.
 *
 * @param name Clock names defined in clock_name_t
 * @return Clock frequency value in hertz
 */
uint32_t CLOCK_GetFreq(clock_name_t name);

/*!
 * @brief Get the Core clock frequency.
 * @return core clock frequency in HZ.
 */
uint32_t CLOCK_GetCoreClkFreq(void);

/*!
 * @brief Get the FIRC clock frequency.
 * @return FIRC frequency in HZ.
 */
uint32_t CLOCK_GetFircClkFreq(void);

/*!
 * @brief Get the FXOSC clock frequency.
 * @return FXOSC frequency in HZ.
 */
uint32_t CLOCK_GetFxoscFreq(void);

/*!
 * @brief Get the AIPS_PLAT_CLK clock frequency.
 * @return frequency in HZ.
 */
uint32_t CLOCK_GetAipsPlatClkFreq(void);

/*!
 * @brief Get the AIPS_SLOW_CLK clock frequency.
 * @return frequency in HZ.
 */
uint32_t CLOCK_GetAipsSlowClkFreq(void);

/*!
 * @brief Get the HSE_CLK clock frequency.
 * @return frequency in HZ.
 */
uint32_t CLOCK_GetHseClkFreq(void);

/*!
 * @brief Get the DCM_CLK clock frequency.
 * @return frequency in HZ.
 */
uint32_t CLOCK_GetDcmClkFreq(void);

#if defined(FSL_FEATURE_MC_CGM_HAS_LBIST_CLK_DIV) && (FSL_FEATURE_MC_CGM_HAS_LBIST_CLK_DIV != 0U)
/*!
 * @brief Get the LBIST_CLK clock frequency.
 * @return frequency in HZ.
 */
uint32_t CLOCK_GetLbistClkFreq(void);
#endif /* FSL_FEATURE_MC_CGM_HAS_LBIST_CLK_DIV */

#if defined(FSL_FEATURE_CLOCK_HAS_QSPI) && (FSL_FEATURE_CLOCK_HAS_QSPI != 0U)
/*!
 * @brief Get the QSPI_CLK clock frequency.
 * @return frequency in HZ.
 */
uint32_t CLOCK_GetQspiClkFreq(void);

/*!
 * @brief Get the QSPI_SFCK clock frequency.
 * @return frequency in HZ.
 */
uint32_t CLOCK_GetQspiSfckFreq(void);
#endif /* FSL_FEATURE_CLOCK_HAS_QSPI */

/*!
 * @brief Get the PLL_PHI clock frequency.
 * @param index The PHI index.
 * @return PLL_PHIx frequency in HZ.
 */
uint32_t CLOCK_GetPllPhiClkFreq(uint32_t index);

/*!
 * @brief Get the FLEXCAN PE clock frequency.
 * @param index The FLEXCAN index.
 * @return frequency in HZ.
 */
uint32_t CLOCK_GetFlexcanPeClkFreq(uint32_t index);

/*!
 * @brief Get the STM clock frequency.
 * @param index The STM index.
 * @return frequency in HZ.
 */
uint32_t CLOCK_GetStmClkFreq(uint32_t index);

#if defined(FSL_FEATURE_CLOCK_HAS_EMAC) && (FSL_FEATURE_CLOCK_HAS_EMAC != 0U)
/*!
 * @brief Get the EMAC RX clock frequency.
 * @return frequency in HZ.
 */
uint32_t CLOCK_GetEmacRxClkFreq(void);

/*!
 * @brief Get the EMAC TX clock frequency.
 * @return frequency in HZ.
 */
uint32_t CLOCK_GetEmacTxClkFreq(void);

/*!
 * @brief Get the EMAC TS clock frequency.
 * @return frequency in HZ.
 */
uint32_t CLOCK_GetEmacTsClkFreq(void);
#endif /* FSL_FEATURE_CLOCK_HAS_EMAC */

#if defined(__cplusplus)
}
#endif /* __cplusplus */

/*! @} */

#endif /* FSL_CLOCK_H_ */
